In [1]:
import pandas as pd

In [5]:
y_train  = pd.read_csv('../../data/raw/y_train.csv')
demographic = pd.read_csv('../../data/raw/demo.csv')
address = pd.read_csv('../../data/raw/adr.csv')
saving_acc = pd.read_csv('../../data/raw/sa.csv')
cc_transaction = pd.read_csv('../../data/raw/cc_txn.csv')

In [12]:
category = pd.read_csv('../../data/not_raw/cat.csv')

------------------

In [7]:
y_train.head()

   ip_id  label
0      1    0.0
1      2    0.0
2      3    0.0
3      4    0.0
4      5    0.0

In [17]:
y_train.shape

(6361, 2)

In [15]:
len(y_train['ip_id'].unique())

6361

y uniqe ดังนั้นจะใช้อันนี้เป็นแกน แล้ว merge ตารางอื่นเข้าหา

-----------------------------

In [8]:
demographic.head()

,ip_id,brth_yr,act_strt_dt,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd
0,1,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9
1,2,1986.0,2010-06-08,1.0,43355.0,540649.0,2.0,2.0,1.0,3
2,3,1983.0,2013-12-06,0.0,48836.0,310503.0,2.0,2.0,2.0,12
3,4,1984.0,2009-12-27,0.0,44397.0,34209.0,2.0,2.0,5.0,11
4,5,1986.0,2006-09-01,1.0,43281.0,39963.0,2.0,3.0,6.0,9

In [20]:
demographic.shape

(10299, 10)

In [21]:
len(demographic['ip_id'].unique())

10299

--------------------------------

ที่อยู่อาศัย

In [26]:
address[0:10]

   ip_id                                      prov
0      2  ลำพูน
1      6  นครปฐม
2      6  นครราชสีมา
3      8  นครราชสีมา
4     12  ปทุมธานี
5     12  อุตรดิตถ์
6     14  พังงา
7     14  ภูเก็ต
8     14  มุกดาหาร
9     16  ปัตตานี

In [24]:
address.shape

(4737, 2)

In [25]:
len(address['ip_id'].unique())

3633

ทำไมทั้งหมดกับ uniqe ไม่เหมือนกันวะ แสดงว่าคนนึงอยู่ได้หลายจังหวัด

----------------------------

In [10]:
saving_acc.head()

   ip_id          dt channel  tp     amt
0      1  2017-02-06     EDC  DR  1045.0
1      1  2017-02-28  Branch  CR   995.0
2      1  2017-03-15   KPlus  DR  6311.0
3      1  2017-03-22   KPlus  CR   884.0
4      1  2017-03-26  Branch  DR  4890.0

In [32]:
saving_acc.shape

(478658, 5)

In [33]:
len(saving_acc['ip_id'].unique())

9963

ให้มาเกินคนที่เรามีข้อมูล บางส่วนเป็นของคนที่เราไม่มีข้อมูลว่าแม่งโกงป่าว

-------------------

In [11]:
cc_transaction.head()

   ip_id          dt category   card  txn_amt
0      1  2017-02-02     cat2  card1  13150.0
1      1  2017-02-06    cat15  card2   9786.0
2      1  2017-02-12     cat2  card1  11165.0
3      1  2017-02-15    cat15  card1   8948.0
4      1  2017-02-18     cat3  card2   4609.0

In [34]:
cc_transaction.shape

(627894, 5)

In [35]:
len(cc_transaction['ip_id'].unique())

7488

เช่นกันกับการฝากเงิน

----------------

In [13]:
category

       no                        main_category
0    cat1                  Fashion and Apparel
1    cat9                               Sports
2    cat2                    Health and beauty
3   cat10                             Children
4    cat3                    Food and Beverage
5   cat11                             Services
6    cat4            Appliance and Electronics
7   cat12                            Education
8    cat5  Office supplies books and gift shop
9   cat13                                  Pet
10   cat6        Automotive shops and Vehicles
11  cat14                               Travel
12   cat7                        Entertainment
13  cat15                        Accommodation
14   cat8                      Home and Garden
15  cat16                               Others

---------------------------

In [18]:
result1 = pd.merge(y_train, demographic, how='left', on=['ip_id', 'ip_id'])

In [22]:
result1.shape

(6361, 11)

In [23]:
result1.head()

,ip_id,label,brth_yr,act_strt_dt,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd
0,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9
1,2,0.0,1986.0,2010-06-08,1.0,43355.0,540649.0,2.0,2.0,1.0,3
2,3,0.0,1983.0,2013-12-06,0.0,48836.0,310503.0,2.0,2.0,2.0,12
3,4,0.0,1984.0,2009-12-27,0.0,44397.0,34209.0,2.0,2.0,5.0,11
4,5,0.0,1986.0,2006-09-01,1.0,43281.0,39963.0,2.0,3.0,6.0,9

--------------------

In [27]:
result2 = pd.merge(result1, address, how='left', on=['ip_id', 'ip_id'])

In [28]:
result2.shape

(7465, 12)

จะเห็นว่าแถวเพิ่มขึ้นแสดงว่ามันแตกเป็นหลายแถวที่มีจังหวัดต่างกัน

In [29]:
result2[0:10]

,ip_id,label,brth_yr,act_strt_dt,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd,prov
0,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,NaN
1,2,0.0,1986.0,2010-06-08,1.0,43355.0,540649.0,2.0,2.0,1.0,3,ลำพูน
2,3,0.0,1983.0,2013-12-06,0.0,48836.0,310503.0,2.0,2.0,2.0,12,NaN
3,4,0.0,1984.0,2009-12-27,0.0,44397.0,34209.0,2.0,2.0,5.0,11,NaN
4,5,0.0,1986.0,2006-09-01,1.0,43281.0,39963.0,2.0,3.0,6.0,9,NaN
5,6,0.0,1987.0,2005-06-17,0.0,49867.0,590634.0,2.0,4.0,2.0,12,นครปฐม
6,6,0.0,1987.0,2005-06-17,0.0,49867.0,590634.0,2.0,4.0,2.0,12,นครราชสีมา
7,7,0.0,1984.0,2014-07-30,1.0,42205.0,500.0,2.0,3.0,2.0,6,NaN
8,8,0.0,1976.0,2014-06-27,0.0,42422.0,845055.0,2.0,2.0,6.0,2,นครราชสีมา
9,9,0.0,1983.0,2006-04-21,1.0,38264.0,1717875.0,1.0,2.0,3.0,2,NaN

In [45]:
result2.to_csv('../../data/not_raw/demo_with_address.csv', index=False)

------------

In [30]:
result3 = pd.merge(result1, saving_acc, how='left', on=['ip_id', 'ip_id'])

In [31]:
result3.shape

(238896, 15)

In [36]:
result3[0:10]

,ip_id,label,brth_yr,act_strt_dt,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd,dt,channel,tp,amt
0,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-06,EDC,DR,1045.0
1,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-28,Branch,CR,995.0
2,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-03-15,KPlus,DR,6311.0
3,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-03-22,KPlus,CR,884.0
4,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-03-26,Branch,DR,4890.0
5,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-03-29,ATM,CR,5955.0
6,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-03-30,CDM,CR,6879.0
7,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-04-02,CorporateConnect,CR,3082.0
8,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-04-10,ATM,DR,735.0
9,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-04-20,ATM,DR,1278.0

In [40]:
len(result3['ip_id'].unique())

6361

In [46]:
result3.to_csv('../../data/not_raw/demo_with_saving_acc.csv', index=False)

--------------------------------------------------

In [37]:
result4 = pd.merge(result1, cc_transaction, how='left', on=['ip_id', 'ip_id'])

In [38]:
result4.shape

(608588, 15)

In [39]:
result4[0:10]

,ip_id,label,brth_yr,act_strt_dt,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd,dt,category,card,txn_amt
0,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-02,cat2,card1,13150.0
1,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-06,cat15,card2,9786.0
2,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-12,cat2,card1,11165.0
3,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-15,cat15,card1,8948.0
4,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-18,cat3,card2,4609.0
5,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-19,cat8,card3,3924.0
6,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-21,cat7,card2,2874.0
7,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-24,cat14,card2,9589.0
8,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-24,cat15,card2,6025.0
9,1,0.0,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9,2017-02-26,cat11,card3,494.0

In [41]:
len(result4['ip_id'].unique())

6361

In [ ]:
result4.to_csv('../../data/not_raw/demo_with_cc_transaction.csv', index=False)